app/Controllers/Admin/AnggotaController.php

    public function anggota()
    {
        $model = new AnggotaModel();
        $data['anggota'] = $model->findAll();
---
SELECT *
FROM `anggota`