app/Controllers/Admin/UpberitaController.php

    public function uploadberita()
    {
        $beritaModel = new BeritaModel();
        $data = [
            'title' => 'Upload Berita',
            'berita' => $beritaModel->findAll()
        ];
---
SELECT *
FROM `berita`