app/Controllers/PenggunaController.php

SELECT *
FROM `pengguna`
---
  public function index()
  {
    $model = new PenggunaModel();
    $data['pengguna'] = $model->findAll();